#=================================================bubble_sort=================================================#

# Асимптотическая сложность алгоритма - O(N^2)

# Быстрее всего работает на почти полностью отсортированных данных O(N)


def insert_sort(lst: list) -> list:
    i = 1
    while i < len(lst):
        j = i - 1
        while lst[j + 1] < lst[j] and j >= 0:
            lst[j + 1], lst[j] = lst[j], lst[j + 1]
            j -= 1

        i += 1
    return lst


print(insert_sort([2, 3, 9, 1234, 9, 20]))